const body2_btn = ['熱銷口味','其他口味']
const mobile_data = {
    '熱銷口味':[
        {
            img:'./image/body2/img.png',
            title:'經典香草',
            text:'採用馬加斯加的香草豆莢下去取出香草籽，下去熬煮讓冰淇淋充\
            分帶有天然的淡淡香草味，每一份都帶\
            有許多的香草籽，非一般市面化學香精\
            可比，讓天然的味道充滿每一分味蕾',
        },
        {
            img:'./image/body2/img2.png',
            title:'戀戀草莓',
            text:'上面鋪著我們自己做的酒香草莓丁，滿滿的酒香草莓丁搭配著草莓冰淇淋，\
            吃起來有種很濃的草莓味還有淡淡的奶香，一直是我們熱賣的前三名，是你不容錯過的口味',
        },
        {
            img:'./image/body2/img3.png',
            title:'苦甜巧克力',
            text:'使用委內瑞拉72%的巧克力下去調\
            製而成。跟一般甜膩的巧克力不同，除\
            了有濃厚的巧克力味道外，我們還加入\
            了橙酒，不僅更能帶出巧克力的味道外\
            更有些許橙香',
        },
        {
            img:'./image/body2/img4.png',
            title:'蘭姆葡萄',
            text:'由甘蔗釀造蒸餾而成的蘭姆酒，\
            我們利用葡萄乾泡入蘭姆酒，讓每一顆葡\
            萄乾都吸入飽滿的蘭姆酒後才下去製\
            作，搭配鮮奶讓冰淇淋每一口都有淡淡\
            的蘭姆香喔',
        },
    ],
    '其他口味':[
        {
            img:'./image/body2/img5.png',
            title:'日式抹茶',
            text:'採用日本進口的抹茶粉，味道甘醇\
            濃郁不苦澀。非一般台灣市面上的綠茶\
            粉，兩者有極大的不同，久置即產生沈澱，口感也會不好',
        },
        {
            img:'./image/body2/img6.png',
            title:'杏仁牛奶',
            text:'採用天然南杏仁研磨成的杏仁粉下\
            去製作成杏仁牛奶冰淇淋，不會有外面\
            的刺鼻化學香料味道，吃起來很順口更\
            有淡淡的杏仁甜味',
        },
        {
            img:'./image/body2/img7.png',
            title:'香蕉可可',
            text:'用烤過後的香蕉加入鮮奶裡在加入些許\
            巧克力讓味道產生變化，熬煮製作而成\
            的冰淇淋每一口有天然香蕉的香',
        },
        {
            img:'./image/body2/img8.png',
            title:'糯米桂圓',
            text:'桂圓泡酒後加入蒸熟後的圓糯米，在加\
            入鮮奶熬煮做成冰淇淋，每一口除了有\
            淡淡的桂圓香氣以外更因為糯米讓冰淇\
            淋口感更加綿密',
        },
        {
            img:'./image/body2/img9.png',
            title:'香濃芋頭',
            text:'採用大甲芋頭去蒸煮過後打成泥加入鮮\
            奶，再熬煮做成冰淇淋，每一口都有細\
            細的芋頭顆粒外更有著芋頭天然的微香',
        },
        {
            img:'./image/body2/img.png',
            title:'難忘紅豆',
            text:'蒸煮過後的軟爛紅豆打泥調入鮮奶熬煮\
            在製作冰淇淋時再依序，加入紅豆，讓\
            每一口都能吃到聞到紅豆的香甜味',
        },
        {
            img:'./image/body2/img11.png',
            title:'甜蜜蘋果',
            text:'採用新鮮的蘋果打成泥後加入鮮奶中熬\
            煮，在製成冰淇淋時，再調入細碎蘋果，\
            除了可以吃到蘋果的清香外更可吃到蘋果的顆粒',
        },
        {
            img:'./image/body2/img12.png',
            title:'黑芝麻',
            text:'採用台灣黑芝麻，黑芝麻有著保健養身\
            的功效，我們將新鮮黑芝麻，研磨成粉\
            過篩後加入鮮奶中熬煮製做出的冰淇淋，不僅沒有油耗味更有著芝麻香',
        },
        {
            img:'./image/body2/img13.png',
            title:'酒釀櫻桃',
            text:'我們用當季新鮮的櫻桃去籽後，泡入白\
            蘭地讓每顆都吸滿酒香，在依序調入鮮\
            奶中熬煮，做出的冰淇淋每口都有著濃郁的櫻桃酒香',
        },
        {
            img:'./image/body2/img14.png',
            title:'奶油蜜糖',
            text:'使用白蘭地奶酒下去調配製成冰淇\
            淋，吃起來有淡淡酒香但是沒有酒氣，\
            淡淡清香爽口的冰淇淋一直是少女的最愛',
        },
        {
            img:'./image/body2/img15.png',
            title:'芒果雪酪',
            text:'我們目前口味中唯一一種不加牛奶製成的冰淇淋，\
            為不能吃牛奶的客人朋友們開發出的冰淇淋。\
            整顆愛文打泥後加入少許冰糖提升甜味去製成',
        },
    ],
}
var body2_click = '熱銷口味'


const body3_data = [
    {
        img:'./image/body3/img.png',
        title:'苦甜巧克力',
        text:'使用委內瑞拉72%的巧克力下去調製，除了濃厚的巧克力味道外還有些許橙香',
        text2:'一杯/NT$ 60',
        price:60,
        amount:0,
    },
    {
        img:'./image/body3/img2.png',
        title:'香濃芋頭',
        text:'採用大甲芋頭去蒸煮過後打成泥加入鮮奶製成，每一口都有細細的芋頭顆粒外更有著芋頭天然的微香',
        text2:'一杯/NT$ 50',
        price:50,
        amount: 0,
    },
    {
        img:'./image/body3/img3.png',
        title:'香蕉可可',
        text:'用烤過後的香蕉加入鮮奶裡在加入些許巧克力製作而成，每一口有天然香蕉的香',
        text2:'一杯/NT$ 50',
        price:50,
        amount: 0,
    },
    {
        img:'./image/body3/img4.png',
        title:'黑芝麻',
        text:'新鮮黑芝麻，研磨成粉過篩後加入鮮奶中熬煮製做出的冰淇淋',
        text2:'一杯/NT$ 50',
        price:50,
        amount: 0,
    },
    {
        img:'./image/body3/img5.png',
        title:'經典香草',
        text:'採用馬加斯加的香草豆莢下去取出香草籽，連帶香草莢，下去熬煮讓冰淇淋充分帶有天然的淡淡香草味',
        text2:'一杯/NT$ 60',
        price:60,
        amount: 0,
    },
    {
        img:'./image/body3/img6.png',
        title:'蘭姆葡萄',
        text:'由甘蔗釀造蒸餾的蘭姆酒再加入葡萄乾泡入，搭配鮮奶讓冰淇淋每一口都有淡淡的蘭姆香喔',
        text2:'一杯/NT$ 60',
        price:60,
        amount: 0,
    },
]


const robot_data = {
    '關於我們':{
        href:'body1',
        text:'王台南手工冰淇淋堅持以牛奶&鮮奶油&天然食材製成冰淇淋\
        ，絕不添加人工香料色素等任何化學物質，也不加入任何一滴水，堅持原味',
    },
    '訂購商品':{
        href:'body3',
        text:'感謝您查看我們的商品，商品將於您訂購後以簡訊通知您，請您記得查看通知',
    },
    '熱門商品統計':{
        href:'body4',
        text:'本網站進行了四種熱門口味的喜愛程度排行榜，以香草口味最深受大家喜愛',
    },
}